In [2]:
import pandas as pd

In [3]:
a = [1,7,2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [4]:
type(myvar)

pandas.core.series.Series

In [5]:
a = [1,7,2]
myvar=pd.Series(a, index=["x","y","z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [6]:
calories = {"day1":420,"day2":380,"day3":390}
myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [7]:
data ={
    "calories": [420,390,380],
    "duration":[40,30,50]
}

df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        40
1       390        30
2       380        50

In [8]:
df

   calories  duration
0       420        40
1       390        30
2       380        50

In [9]:
print(df.loc[0])

calories    420
duration     40
Name: 0, dtype: int64

In [12]:
print(df.loc[[0,2]])

   calories  duration
0       420        40
2       380        50

In [13]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [14]:
df

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [16]:
print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

In [41]:
df = pd.read_csv("data.csv")

print(df)

     Duration  Pulse  Maxpulse  Calories     Time
0          60    110       130     409.1  Morning
1          60    117       145     479.0  Morning
2          60    103       135     340.0  Morning
3          45    109       175     282.4  Morning
4          45    117       148     406.0  Morning
..        ...    ...       ...       ...      ...
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

[169 rows x 5 columns]

In [42]:
df.head()

   Duration  Pulse  Maxpulse  Calories     Time
0        60    110       130     409.1  Morning
1        60    117       145     479.0  Morning
2        60    103       135     340.0  Morning
3        45    109       175     282.4  Morning
4        45    117       148     406.0  Morning

In [20]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/amar/anaconda3/lib/python3.9/site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in /home/amar/anaconda3/lib/python3.9/site-packages (from openpyxl) (1.1.0)

In [40]:
df1 = pd.read_excel("data.xlsx")

In [22]:
print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [24]:
df.sample(frac=0.5)

     Duration  Pulse  Maxpulse  Calories
97         25    152       168     244.2
51         80    123       146     643.1
146        60    107       136     400.0
113        45    100       120     225.3
127        60    109       127     382.0
..        ...    ...       ...       ...
136        45    117       143     317.7
58         20    153       172     226.4
91         45    107       137       NaN
165        60    110       145     300.0
158        60    114       150     382.8

[84 rows x 4 columns]

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
 4   Time      169 non-null    object
dtypes: float64(1), int64(3), object(1)
memory usage: 6.7+ KB

In [44]:
df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [45]:
df.shape

(169, 5)

In [46]:
df.isnull()

     Duration  Pulse  Maxpulse  Calories   Time
0       False  False     False     False  False
1       False  False     False     False  False
2       False  False     False     False  False
3       False  False     False     False  False
4       False  False     False     False  False
..        ...    ...       ...       ...    ...
164     False  False     False     False  False
165     False  False     False     False  False
166     False  False     False     False  False
167     False  False     False     False  False
168     False  False     False     False  False

[169 rows x 5 columns]

In [47]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
Time        0
dtype: int64

In [48]:
df.min()

Duration         15
Pulse            80
Maxpulse        100
Calories       50.3
Time        Evening
dtype: object

In [49]:
df.max()

Duration        300
Pulse           159
Maxpulse        184
Calories     1860.4
Time        Morning
dtype: object

In [50]:
df.mean()

/tmp/ipykernel_7742/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Duration     63.846154
Pulse       107.461538
Maxpulse    134.047337
Calories    375.790244
dtype: float64

In [51]:
df['Calories'].mean()

375.79024390243916

In [52]:
df['Calories'].median()

318.6

In [53]:
df.mode()

   Duration  Pulse  Maxpulse  Calories     Time
0        60    100       120     300.0  Morning

In [54]:
df['Calories'].mode()

0    300.0
Name: Calories, dtype: float64

In [55]:
df['Time'].unique()

array(['Morning', 'Evening'], dtype=object)

In [56]:
df['Time'].nunique()

2

In [58]:
df['Time'].value_counts()/len(df)*100

Morning    96.449704
Evening     3.550296
Name: Time, dtype: float64

In [60]:
df.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories', 'Time'], dtype='object')

In [61]:
df[["Duration","Maxpulse"]]

     Duration  Maxpulse
0          60       130
1          60       145
2          60       135
3          45       175
4          45       148
..        ...       ...
164        60       140
165        60       145
166        60       145
167        75       150
168        75       150

[169 rows x 2 columns]

In [62]:
df["Calories"].max()

1860.4

In [68]:
df[df["Maxpulse"]>130]

     Duration  Pulse  Maxpulse  Calories     Time
1          60    117       145     479.0  Morning
2          60    103       135     340.0  Morning
3          45    109       175     282.4  Morning
4          45    117       148     406.0  Morning
6          60    110       136     374.0  Evening
..        ...    ...       ...       ...      ...
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

[88 rows x 5 columns]

In [69]:
df[df["Maxpulse"]>130]["Maxpulse"].mean()

145.64772727272728

In [73]:
df[(df["Time"]=='Evening')]

    Duration  Pulse  Maxpulse  Calories     Time
6         60    110       136     374.0  Evening
19        45     97       125     243.0  Evening
38        60    100       120     300.0  Evening
47        45    111       136     300.0  Evening
54        30    136       175     238.0  Evening
70       150     97       129    1115.0  Evening

In [74]:
df[(df["Time"]=='Evening') & (df["Pulse"]>130)]

    Duration  Pulse  Maxpulse  Calories     Time
54        30    136       175     238.0  Evening

In [75]:
df[~((df["Time"]=='Evening') & (df["Pulse"]>130))]

     Duration  Pulse  Maxpulse  Calories     Time
0          60    110       130     409.1  Morning
1          60    117       145     479.0  Morning
2          60    103       135     340.0  Morning
3          45    109       175     282.4  Morning
4          45    117       148     406.0  Morning
..        ...    ...       ...       ...      ...
164        60    105       140     290.8  Morning
165        60    110       145     300.0  Morning
166        60    115       145     310.2  Morning
167        75    120       150     320.4  Morning
168        75    125       150     330.4  Morning

[168 rows x 5 columns]

In [76]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df2 = pd.DataFrame(ipl_data)

In [77]:
df2

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [79]:
gp = df2.groupby("Team")

In [80]:
gp.first()

        Rank  Year  Points
Team
Devils     2  2014     863
Kings      3  2014     741
Riders     1  2014     876
Royals     4  2014     701

In [81]:
gp.groups

{'Devils': [2, 3], 'Kings': [4, 5, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10]}

In [82]:
gp = df2.groupby("Year")

for name, group in gp:
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    Kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [84]:
gp=df2.groupby("Year")
print(gp.get_group(2014))

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [86]:
gp = df2.groupby("Year")

In [87]:
gp.agg("mean")

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [88]:
gp.mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [89]:
gp.max()

        Team  Rank  Points
Year
2014  Royals     4     876
2015  Royals     4     812
2016  Riders     2     756
2017  Riders     2     788

In [90]:
gp.agg(["sum","mean","max"])

/tmp/ipykernel_7742/3914011348.py:1: FutureWarning: ['Team'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  gp.agg(["sum","mean","max"])

     Rank          Points
      sum mean max    sum    mean  max
Year
2014   10  2.5   4   3181  795.25  876
2015   10  2.5   4   3078  769.50  812
2016    3  1.5   2   1450  725.00  756
2017    3  1.5   2   1478  739.00  788

In [91]:
gp["Points"].agg(["sum","mean","max"])

       sum    mean  max
Year
2014  3181  795.25  876
2015  3078  769.50  812
2016  1450  725.00  756
2017  1478  739.00  788

In [93]:
gp = df2.groupby(["Team","Year"])

In [94]:
gp.mean()

             Rank  Points
Team   Year
Devils 2014   2.0   863.0
       2015   3.0   673.0
Kings  2014   3.0   741.0
       2015   4.0   812.0
       2016   1.0   756.0
       2017   1.0   788.0
Riders 2014   1.0   876.0
       2015   2.0   789.0
       2016   2.0   694.0
       2017   2.0   690.0
Royals 2014   4.0   701.0
       2015   1.0   804.0

In [95]:
gp = df2.groupby("Team")

In [96]:
score = lambda x:(x-x.mean())/x.std()*10

In [97]:
gp.transform(score)

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4    5.000000 -11.618950 -10.423334
5   11.666667  -3.872983  11.834011
6   -8.333333   3.872983  -5.721078
7   -8.333333  11.618950   4.310401
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

In [99]:
df2

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [100]:
df2.groupby("Team").filter(lambda x:len(x)>=3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [102]:
df2["Team"].value_counts()

Riders    4
Kings     4
Devils    2
Royals    2
Name: Team, dtype: int64

In [103]:
df2

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [104]:
df2.pivot("Team","Year","Points")

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

In [106]:
df2.pivot(index='Rank',columns='Year',values=['Points','Team'])

     Points                   Team
Year   2014 2015 2016 2017    2014    2015    2016    2017
Rank
1       876  804  756  788  Riders  Royals   Kings   Kings
2       863  789  694  690  Devils  Riders  Riders  Riders
3       741  673  NaN  NaN   Kings  Devils     NaN     NaN
4       701  812  NaN  NaN  Royals   Kings     NaN     NaN